#Дан список с визитами по городам и странам. Напишите код, который возвращает отфильтрованный список geo_logs, содержащий только визиты из России.
geo_logs = [
    {'visit1': ['Москва', 'Россия']},
    {'visit2': ['Дели', 'Франция']},
    {'visit3': ['Владимир', 'Россия']},
    {'visit4': ['Лиссабон', 'Франция']},
    {'visit5': ['Париж', 'Франция']},
    {'visit6': ['Лиссабон', 'Португалия']},
    {'visit7': ['Тула', 'Россия']},
    {'visit8': ['Тула', 'Россия']},
    {'visit9': ['Курск', 'Россия']},
    {'visit10': ['Архангельск', 'Россия']}
]
for visit in geo_logs[::-1]:
  if 'Россия' not in list(visit.values())[0]:
    geo_logs.remove(visit)
print(geo_logs)
